#использовать "../src"
#Использовать asserts
#Использовать logos

#Использовать "./fixtures/ТестоваяЛиба"

Перем юТест;
Перем Лог;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;

	ИменаТестов = Новый Массив;

	ИменаТестов.Добавить("ТестДолжен_ПроверитьСозданиеИнтерфейсаИзОбъекта");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьСозданиеИнтерфейсаИзОбъектаИсключая");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьСозданиеИнтерфейсаИзИнтерфейса");
	
	ИменаТестов.Добавить("ТестДолжен_ПроверитьРеализациюИнтерфейса");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьПолучениеРеализованныеМетоды");

	Возврат ИменаТестов;

КонецФункции

Процедура ТестДолжен_ПроверитьСозданиеИнтерфейсаИзОбъекта() Экспорт

	ОбъектПроверки = ПолучитьТестовыйОбъект();
	РасширенныйРефлектор = Новый РефлекторОбъекта(ОбъектПроверки);

	КартаОбъекта = РасширенныйРефлектор.ПолучитьТаблицуМетодов();

	Интерфейс = Новый ИнтерфейсОбъекта;
	Интерфейс.ИзОбъекта(ОбъектПроверки);

	РеализуетИнтерфейс = Интерфейс.Реализован(КартаОбъекта);

	Утверждения.ПроверитьИстину(РеализуетИнтерфейс, "Интерфейс реализуется объектом");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьСозданиеИнтерфейсаИзОбъектаИсключая() Экспорт

	ОбъектПроверки = ПолучитьТестовыйОбъект();
	РасширенныйРефлектор = Новый РефлекторОбъекта(ОбъектПроверки);

	КартаОбъекта = РасширенныйРефлектор.ПолучитьТаблицуМетодов();

	Интерфейс = Новый ИнтерфейсОбъекта;
	Интерфейс.ИзОбъектаИсключая(ОбъектПроверки, "Функция1 Функция2");

	РеализуетИнтерфейс = Интерфейс.Реализован(КартаОбъекта);

	Утверждения.ПроверитьИстину(РеализуетИнтерфейс, "Интерфейс реализуется объектом");

	РеализованныеМетодыИнтерфейса = Интерфейс.РеализованныеМетоды(КартаОбъекта);
	
	Утверждения.ПроверитьЛожь(РеализованныеМетодыИнтерфейса.Свойство("Функция1"), "Метод <Функция1> интерфейса не должен реализовываться объектом");
	Утверждения.ПроверитьЛожь(РеализованныеМетодыИнтерфейса.Свойство("Функция2"), "Метод <Функция2> интерфейса не должен реализовываться объектом");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьСозданиеИнтерфейсаИзИнтерфейса() Экспорт

	ОбъектПроверки = ПолучитьТестовыйОбъект();
	РасширенныйРефлектор = Новый РефлекторОбъекта(ОбъектПроверки);

	КартаОбъекта = РасширенныйРефлектор.ПолучитьТаблицуМетодов();

	Интерфейс = Новый ИнтерфейсОбъекта;
	Интерфейс.Ф("Функция1")
			 .П("Процедура1");

	Интерфейс2 = Новый ИнтерфейсОбъекта;
	Интерфейс2.Ф("Функция2", 2);
	Интерфейс2.ИзИнтерфейса(Интерфейс);

	РеализуетИнтерфейс = Интерфейс.Реализован(КартаОбъекта);

	Утверждения.ПроверитьИстину(РеализуетИнтерфейс, "Интерфейс реализуется объектом");

	НеРеализованныйИнтерфейс = Новый ИнтерфейсОбъекта;
	НеРеализованныйИнтерфейс.Ф("ЛиповаяФункция", 2).П("ЛиповаяПроцедура", 3);
	НеРеализованныйИнтерфейс.ИзИнтерфейса(Интерфейс2, Ложь);

	РеализуетИнтерфейс = НеРеализованныйИнтерфейс.Реализован(КартаОбъекта);

	Утверждения.ПроверитьЛожь(РеализуетИнтерфейс, "Интерфейс <НеРеализованныйИнтерфейс> не реализуется объектом");


КонецПроцедуры

Процедура ТестДолжен_ПроверитьРеализациюИнтерфейса() Экспорт

	Интерфейс = Новый ИнтерфейсОбъекта;
	Интерфейс.Ф("Функция1")
			 .П("Процедура1");


	НеРеализованныйИнтерфейс = Новый ИнтерфейсОбъекта;
	НеРеализованныйИнтерфейс.Ф("ЛиповаяФункция", 2).П("ЛиповаяПроцедура", 3);

	ОбъектПроверки = ПолучитьТестовыйОбъект();
	РасширенныйРефлектор = Новый РефлекторОбъекта(ОбъектПроверки);

	КартаОбъекта = РасширенныйРефлектор.ПолучитьТаблицуМетодов();

	РеализуетИнтерфейс = Интерфейс.Реализован(КартаОбъекта);

	Утверждения.ПроверитьИстину(РеализуетИнтерфейс, "Интерфейс реализуется объектом");

	РеализуетИнтерфейс = НеРеализованныйИнтерфейс.Реализован(КартаОбъекта);

	Утверждения.ПроверитьЛожь(РеализуетИнтерфейс, "Интерфейс <НеРеализованныйИнтерфейс> не реализуется объектом");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьПолучениеРеализованныеМетоды() Экспорт

	Интерфейс = Новый ИнтерфейсОбъекта;
	Интерфейс.Ф("Функция1")
			 .П("Процедура1")
			 .Ф("ЛиповаяФункция", 2)
			 .П("ЛиповаяПроцедура", 3);

	РасширенныйРефлектор = Новый РефлекторОбъекта(Новый ТестовыйКласс);
	КартаОбъекта = РасширенныйРефлектор.ПолучитьТаблицуМетодов();

	РеализованныеМетодыИнтерфейса = Интерфейс.РеализованныеМетоды(КартаОбъекта);
	
	Утверждения.ПроверитьИстину(РеализованныеМетодыИнтерфейса.Функция1, "Метод <Функция1> интерфейса должен реализовываться объектом");
	Утверждения.ПроверитьИстину(РеализованныеМетодыИнтерфейса.Процедура1, "Метод <Процедура1> интерфейса не должен реализовываться объектом");
	
	Утверждения.ПроверитьЛожь(РеализованныеМетодыИнтерфейса.ЛиповаяФункция, "Метод <ЛиповаяФункция> интерфейса не должен реализовываться объектом");
	Утверждения.ПроверитьЛожь(РеализованныеМетодыИнтерфейса.ЛиповаяПроцедура, "Метод <ЛиповаяПроцедура> интерфейса не должен реализовываться объектом");
	
КонецПроцедуры

Функция ПолучитьТестовыйОбъект()

	Возврат ЗагрузитьСценарий("./tests/fixtures/ТестовыйОбъект.os");

КонецФункции

Лог = Логирование.ПолучитьЛог("oscript.lib.reflector");