Перем Свойство1 Экспорт;
Перем Свойство2 Экспорт;
Перем Свойство3 Экспорт;

Процедура НеЭкспортная()
	
КонецПроцедуры

Процедура Процедура1() Экспорт

КонецПроцедуры

Процедура Процедура2(Параметр1, Параметр2 = Истина) Экспорт

КонецПроцедуры

Процедура Процедура3(Параметр1 = Истина, Параметр2) Экспорт

КонецПроцедуры

Функция Функция1() Экспорт
	Возврат Истина;
КонецФункции

Функция Функция2(Параметр1, Параметр2 = Истина) Экспорт
	Возврат Истина;
КонецФункции

Функция Функция3(Параметр1 = Истина, Параметр2) Экспорт
	Возврат Истина;
КонецФункции

&Аннотация1
Функция Функция4(Параметр1 = Истина, Параметр2) Экспорт
	Возврат Истина;
КонецФункции

&Аннотация1
&АннОтация2
Функция Функция5(Параметр1 = Истина, Параметр2) Экспорт
	Возврат Истина;
КонецФункции

&АннотацияСПараметрами(ПараметрАннотации1 = "КакоетоЗначение1", "КакоетоЗначение2", ПараметрАннотации3)
Функция Функция6(Параметр1 = Истина, Параметр2) Экспорт
	Возврат Истина;
КонецФункции


