Перем Свойство1 Экспорт;
Перем Свойство2 Экспорт;
Перем Свойство3 Экспорт;

Перем Свойство4 Экспорт;
Перем Свойство5;

Процедура Процедура1() Экспорт

КонецПроцедуры

Процедура Процедура2(Параметр1, Параметр2 = Истина) Экспорт

КонецПроцедуры

Процедура Процедура3(Параметр1 = Истина, Параметр2) Экспорт

КонецПроцедуры

Процедура ПроцедураДляКеша2(Параметр1 = Истина, Параметр2) Экспорт

КонецПроцедуры

Процедура ПроцедураДляКеша1(Параметр1 = Истина, Параметр2) Экспорт

КонецПроцедуры

Функция Функция1() Экспорт
	Возврат Истина;
КонецФункции

Функция Функция2(Параметр1, Параметр2 = Истина) Экспорт
	Возврат Истина;
КонецФункции

Функция Функция3(Параметр1 = Истина, Параметр2) Экспорт
	Возврат Истина;
КонецФункции